# Экранируем _
s/([^\\])_/\1\\_/g

# Дефис
s/\>-\</"=/g

# Тире в начале строки
s/^[  \t]*(---|—|—|—|–)[  ]/"--* /g

# Тире между слов
s/( | |\t)+([—–-]) /\~"--- /g

# Инициалы
s/(\<[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-Za-z]\.)[\~  ]([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-Za-z]\.)@=/\1\\,\2/g

# Однобуквенные слова
s/(\<[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-Za-z]\.)(\.)@!/\1\~/g
s/(\<[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-Za-z][,]*)[  ]/\1\~/g

# Двух- и трёхбуквенные слова
s/(\<[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-Za-z]{2,3}[,]*)[  ]/\1\~/g

# Многоточие
s/…/.../g
